<a href="https://colab.research.google.com/github/rabindramahato3/AppliedAI/blob/main/PandasBasisPractice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Consider  the following Python dictionary data and Python list labels:

  **data = {
    'birds' : ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
    'age' : [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
    'visits' : [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
    'priority' : ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
            }**
        
  **labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']**

#Problem 1 : 
**Create a DataFrame birds from this dictionary data which has the index labels.**

In [ ]:
# Create a DataFrame birds from dictionary data which has index labels

import pandas as pd
import numpy as np

# Given set of data and labels
data = {
    'birds' : ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
    'age' : [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
    'visits' : [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
    'priority' : ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
            }
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

print('-: Birds Dataframe :- \n')
Birds =  pd.DataFrame( data, index = labels )
Birds

-: Birds Dataframe :-

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

# Problem 2:
**Display a summary of the basic information about birds DataFrame and its data.**

In [ ]:
# Display summary of the basic information about birds DataFrame and its Data

print('Program to Display summary of the basic information about birds DataFrame and its Data \n')

print('-: Birds DataFrame Basic Information :- \n\033[1m')
Birds.info()
print('\n -: Description of Data :- \n',Birds.describe())

Program to Display summary of the basic information about birds DataFrame and its Data

-: Birds DataFrame Basic Information :-

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   birds     10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

 -: Description of Data :-
             age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

# Problem 3 :
**Print the first 2 rows of the birds dataframe**

In [ ]:
# Print first 2 rows of birds dataframe

print('Program to display first two rows of birds dataframe \n')

print('First 2 rows of the birds dataframe : \n')
# calling head() function to select rows in adata frame from top
Birds.head(2)

Program to display first two rows of birds dataframe

First 2 rows of the birds dataframe :

    birds  age  visits priority
a  Cranes  3.5       2      yes
b  Cranes  4.0       4      yes

# Problem 4 :
**Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [ ]:
#  Print all rows with only 'birds'and 'age' columns from birds dataframe

columns = ['birds','age']

print('Program to prints all the rows with only \'birds\' and \'age\' columns from the birds dataframe \n')

print('All the rows with only \'birds\' and \'age\' columns from the birds dataframe : \n')

print(' -: Birds DateFrame :- \n')
Birds[columns]

Program to prints all the rows with only 'birds' and 'age' columns from the birds dataframe

All the rows with only 'birds' and 'age' columns from the birds dataframe :

 -: Birds DateFrame :-

        birds  age
a      Cranes  3.5
b      Cranes  4.0
c     plovers  1.5
d  spoonbills  NaN
e  spoonbills  6.0
f      Cranes  3.0
g     plovers  5.5
h      Cranes  NaN
i  spoonbills  8.0
j  spoonbills  4.0

# Problem 5 :
**select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [ ]:
# select[2,3,7] rows and colums['birds', 'age', 'visits']

print('Program to select[2,3,7] rows and colums[\'birds\', \'age\', \'visits\'] from birds dataframe \n ')

rows = [2,3,7]
columns = ['birds', 'age', 'visits']

print('Selected rows[2,3,7]  and colums[\'birds\', \'age\', \'visits\'] from birds dataframe \n')
print(' -: Birds DateFrame :- \n')
Birds[columns].iloc[rows]

Program to select[2,3,7] rows and colums['birds', 'age', 'visits'] from birds dataframe

Selected rows[2,3,7]  and colums['birds', 'age', 'visits'] from birds dataframe

 -: Birds DateFrame :-

        birds  age  visits
c     plovers  1.5       3
d  spoonbills  NaN       4
h      Cranes  NaN       2

# Problem 6 : 
**select the rows where the number of visits is less than 4**

In [ ]:
# select the rows where the number of visits is less than 4

print('Program to select rows where the number of visits is less than 4 in birds dataframe \n')

print('Selected rows where the number of visits less than 4 in birds dataframe \n')
print(' -: Birds DateFrame :- \n')
Birds[Birds.visits < 4]

Program to select rows where the number of visits is less than 4 in birds dataframe

Selected rows where the number of visits less than 4 in birds dataframe

 -: Birds DateFrame :-

        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

# Problem 7 :
**select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [ ]:
# select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN

print('Program to select rows with columns [\'birds\', \'visits\'] where the age is missing i.e NaN \n')
columns = ['birds', 'visits']

print('Selected rows where with columns [\'birds\', \'visits\'] where the age is missing i.e NaN \n')
print(' -: Birds DateFrame :- \n')
Birds[(Birds.age.isna())][columns]

Program to select rows with columns ['birds', 'visits'] where the age is missing i.e NaN

Selected rows where with columns ['birds', 'visits'] where the age is missing i.e NaN

 -: Birds DateFrame :-

        birds  visits
d  spoonbills       4
h      Cranes       2

# Problem 8 : 
**Select the rows where the birds is a Cranes and the age is less than 4**

In [ ]:
# Select the rows where the birds is a Cranes and the age is less than 4

print('Program to Select the rows where the birds is a Cranes and the age is less than 4 \n')

print('Selected the rows where the birds is a Cranes and the age is less than 4 \n')
print(' -: Birds DateFrame :- \n')
Birds[(Birds.birds == 'Cranes') & (Birds.age < 4)]

Program to Select the rows where the birds is a Cranes and the age is less than 4

Selected the rows where the birds is a Cranes and the age is less than 4

 -: Birds DateFrame :-

    birds  age  visits priority
a  Cranes  3.5       2      yes
f  Cranes  3.0       4       no

# Problem 9 : 
**Select the rows the age is between 2 and 4(inclusive)**

In [ ]:
# Select the rows where age is between 2 and 4(inclusive)

print('Program to Select the rows where age is between 2 and 4(inclusive) \n')

print('Selected the rows where age is between 2 and 4(inclusive)  \n')
print(' -: Birds DateFrame :- \n')
Birds[(Birds.age <= 4) & (Birds.age > 2)]

Program to Select the rows where age is between 2 and 4(inclusive)

Selected the rows where age is between 2 and 4(inclusive)

 -: Birds DateFrame :-

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
f      Cranes  3.0       4       no
j  spoonbills  4.0       2       no

# Problem 10 : 
**Find the total number of visits of the bird Cranes**

In [ ]:
# Find the total number of visits the birds Crane

print('Program to find total number of visits the birds \'Cranes\'')

print('\n Total number of visits the birds \'Cranes\' : ',Birds.where(Birds.birds == 'Cranes').visits.sum())

Program to find total number of visits the birds 'Cranes'

 Total number of visits the birds 'Cranes' :  12.0

# Problem 11 : 
**Calculate the mean age for each different birds in dataframe.**

In [ ]:
# Calculate the mean age for each different birds in dataframe.

print('Program to Calculate mean age for each different birds in dataframe \n')
group = Birds.groupby('birds')

for birds , birds_df in group:
  print(" Entries for birds : ",birds)
  print('----------------------')
  print(birds_df, end='\n\n')
  print('Mean age of {} is {}.'.format(birds,birds_df['age'].mean()), end='\n\n')

print('Mean age for each different birds in dataframe \n')  
print(group.age.mean())

Program to Calculate mean age for each different birds in dataframe

 Entries for birds :  Cranes
----------------------
    birds  age  visits priority
a  Cranes  3.5       2      yes
b  Cranes  4.0       4      yes
f  Cranes  3.0       4       no
h  Cranes  NaN       2      yes

Mean age of Cranes is 3.5.

 Entries for birds :  plovers
----------------------
     birds  age  visits priority
c  plovers  1.5       3       no
g  plovers  5.5       2       no

Mean age of plovers is 3.5.

 Entries for birds :  spoonbills
----------------------
        birds  age  visits priority
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

Mean age of spoonbills is 6.0.

Mean age for each different birds in dataframe

birds
Cranes        3.5
plovers       3.5
spoonbills    6.0
Name: age, dtype: float64

# Problem 12 : 
**Append a new row ‘k’ to dataframe with your choice of values for each column.
Then delete that row to return the original DataFrame**

In [ ]:
#  Append a new row ‘k’ to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame

print('\n Orginal Birds Dataframe :- \n')
print(Birds)
print('\n new row to be added to birds dataframe :- \n')
row = pd.DataFrame({
    'birds' : ['_plovers_'],
    'age': [4.0],
    'visits' : [3],
    'priority' : ['yes']
}, index = ['k'])

print(row, end='\n\n')
print('\n Dataframe after appending a new row:- \n')
Birds = Birds.append(row)
print(Birds)

print('\n Row to be deleted from birds dataframe :-')
print(row)
print('\n Dataframe afer deleting last row added :- \n')
Birds = Birds.drop('k')
print(Birds)

 Orginal Birds Dataframe :-

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

 new row to be added to birds dataframe :-

       birds  age  visits priority
k  _plovers_  4.0       3      yes


 Dataframe after appending a new row:-

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no
k   _plovers_  4.0       3      yes

 Row to be deleted from birds dataframe :-
       birds  age  visits priority
k  _plovers_  4.0       3      yes

 Dataframe afer deleting last row added :-

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      yes
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no

# Problem 13 : 
**Find the number of each type of birds in dataframe (Counts)**

In [ ]:
# Find the number of each type of birds in dataframe (Counts)

group = Birds.groupby('birds')
print('The number of each type of birds in dataframe (Counts) :- \n')
print(group['birds'].count())

The number of each type of birds in dataframe (Counts) :-

birds
Cranes        4
plovers       2
spoonbills    4
Name: birds, dtype: int64

# Problem 14 : 
**Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [ ]:
# Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.

print('Sorted dataframe (birds) first by the values in the \'age\' in decending order, then by the value in the \'visits\' column in ascending order :- \n')
sorted = Birds.sort_values(['age','visits'], ascending=[False, True])
print(sorted)

Sorted dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order :-

        birds  age  visits priority
i  spoonbills  8.0       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
j  spoonbills  4.0       2       no
b      Cranes  4.0       4      yes
a      Cranes  3.5       2      yes
f      Cranes  3.0       4       no
c     plovers  1.5       3       no
h      Cranes  NaN       2      yes
d  spoonbills  NaN       4      yes

# Problem 15 : 
**Replace the priority column values with ’yes’ should be 1 and ‘no’ should be 0**

In [ ]:
# Replace the priority column values with' yes' should be 1 and 'no' should be 0

print('After Replacing the priority column values \'yes\' with 1 and \'no\' with 0 :- \n')
Birds.priority = Birds.priority.replace(['yes','no'],[1, 0])
print(Birds)

After Replacing the priority column values 'yes' with 1 and 'no' with 0 :-

        birds  age  visits  priority
a      Cranes  3.5       2         1
b      Cranes  4.0       4         1
c     plovers  1.5       3         0
d  spoonbills  NaN       4         1
e  spoonbills  6.0       3         0
f      Cranes  3.0       4         0
g     plovers  5.5       2         0
h      Cranes  NaN       2         1
i  spoonbills  8.0       3         0
j  spoonbills  4.0       2         0

# Problem 16 : 
**In the 'birds' column, change the 'Cranes' entries to 'trumpeters'**

In [ ]:
# In the 'birds' column, change the 'Cranes' entries to 'trumpeters'

print('In the \'birds\' column, changing the \'Cranes\' entries to \'trumpeters\' :- \n')
Birds.birds = Birds.birds.replace(['Cranes'],'trumpeters')
print(Birds)

In the 'birds' column, changing the 'Cranes' entries to 'trumpeters' :-

        birds  age  visits  priority
a  trumpeters  3.5       2         1
b  trumpeters  4.0       4         1
c     plovers  1.5       3         0
d  spoonbills  NaN       4         1
e  spoonbills  6.0       3         0
f  trumpeters  3.0       4         0
g     plovers  5.5       2         0
h  trumpeters  NaN       2         1
i  spoonbills  8.0       3         0
j  spoonbills  4.0       2         0